distance = int(input())
day_or_night = input()
# двете начални променливи

price = 0.00
# допълнителна проментлива за стойноста на цената


# Цената на таксито се определя от това да ли е ден или нощ, так е трябва допълнителна променлива

taxi_rate = 0.00

# За да изчислим тарифата на таксито, ще използваме проверка от типа if-else:

if day_or_night == 'day':
    taxi_rate = 0.79
else:
    taxi_rate = 0.90

# Ограниченията, които присъстват в условието на задачата, са относно разстоянието, което студента иска да пропътува.
# По тази причина, ще построим if-elif-else конструкция, с чиято помощ ще открием цената за транспорта в зависимост от подадените километри:

if distance < 20:
    price = 0.70 * distance * taxi_rate
elif distance < 100:
    price = distance * 0.09
else:
    price = distance * 0.06

print(price)

'''
Логиката ан условието ако разстоянието е под 20 то резултатът преминава.
Ако е над 20 то Python го разпознава като False и преминава на следваата част от условието
и т.н.'''


